STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_CentralPeripheral/STM32_BLE/App/app_ble.c
          if(bd_addr_0 > 0x09)
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '7';
          }
          else
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '0';
          }
        }
        break;
      }
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        p_adv_data[i+2] = ST_MANUF_ID_LSB;
        p_adv_data[i+3] = ST_MANUF_ID_MSB;
        p_adv_data[i+4] = BLUESTSDK_V2; /* blueST SDK version */
        p_adv_data[i+5] = BOARD_ID_NUCLEO_WB0; /* Board ID */
        p_adv_data[i+6] = FW_ID_MC_PERIPHERAL; /* FW ID */
        p_adv_data[i+7] = FW_ID_MC_PERIPHERAL_D1; /* FW data 1 */
        p_adv_data[i+8] = FW_ID_MC_PERIPHERAL_D2; /* FW data 2 */
        p_adv_data[i+9] = FW_ID_MC_PERIPHERAL_D3; /* FW data 3 */
        p_adv_data[i+10] = p_bd_addr[5]; /* MSB BD address */
        p_adv_data[i+11] = p_bd_addr[4];
        p_adv_data[i+12] = p_bd_addr[3];
        p_adv_data[i+13] = p_bd_addr[2];
        p_adv_data[i+14] = p_bd_addr[1];
        p_adv_data[i+15] = p_bd_addr[0]; /* LSB BD address */
        break;
      }
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}

/**
* @brief Analyse the advertising report to find a specific peripheral.
*
* This function parses the advertising data to identify a specific peripheral
* based on manufacturer-specific data. If the peripheral is found, its address
* and address type are stored in the application context.
*
* @param adv_data_size Size of the advertising data.
* @param p_adv_data Pointer to the advertising data.
* @param address_type Type of the address (public or random).
* @param p_address Pointer to the address of the advertising device.
* @return uint8_t Returns 1 if the specific peripheral is found, otherwise 0.
*/
static uint8_t analyse_adv_report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;
  
  while(i < adv_data_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        if ((ad_length >= 7)                              && 
            (p_adv_data[i + 2] == ST_MANUF_ID_LSB)        &&
              (p_adv_data[i + 3] == ST_MANUF_ID_MSB)        &&
                (p_adv_data[i + 4] == BLUESTSDK_V2)           &&
                  (p_adv_data[i + 6] == FW_ID_MC_PERIPHERAL)    &&
                    (p_adv_data[i + 7] == FW_ID_MC_PERIPHERAL_D1) &&
                      (p_adv_data[i + 8] == FW_ID_MC_PERIPHERAL_D2) &&
                        (p_adv_data[i + 9] == FW_ID_MC_PERIPHERAL_D3))
        {
          /* Peripheral BlueST v2 detected */
          bleAppContext.deviceServerBdAddrType = address_type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
          
          bleAppContext.deviceServerFound = 0x01;
          
          APP_DBG_MSG("  Peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                      bleAppContext.a_deviceServerBdAddr[5],
                      bleAppContext.a_deviceServerBdAddr[4],
                      bleAppContext.a_deviceServerBdAddr[3],
                      bleAppContext.a_deviceServerBdAddr[2],
                      bleAppContext.a_deviceServerBdAddr[1],
                      bleAppContext.a_deviceServerBdAddr[0]);
          found_status = 1;
        }
        break;
      }
    default:
      break;
    }/* end of switch*/
    
    i += ad_length + 1; /* increment the iterator to go on next element*/
    
    if (found_status != 0)
    {
      break;
    }
  }/* end of while*/
  
  return found_status;
}


/**
* @brief Initiate a connection request to a discovered BLE peripheral.
*
* This function attempts to create a connection to a discovered BLE peripheral device.
* It first sets the connection configuration and then attempts to create the connection.
* If the connection is successfully created, the connection handle is set.
*
* @note This function is specific to CFG_TASK_CONNECTION_REQUEST.
*/
static void Connect_Request(void)
{
  tBleStatus result;
  APP_DBG_MSG("Connect_Request() begin\n");
  
  if (bleAppContext.deviceServerFound != 0)
  {
    
    bleAppContext.deviceServerFound = 0x00;
    
    APP_DBG_MSG("Create connection to Peripheral\n");
    
    result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                  CONN_INT_MS(50u), CONN_INT_MS(100u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02X\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02X\n", result);
    }  
    result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                       bleAppContext.deviceServerBdAddrType,
                                       &bleAppContext.a_deviceServerBdAddr[0]);    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status_Central = APP_BLE_LP_CONNECTING;
      APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_CONNECTION_COMPLETE);
      APP_DBG_MSG("  received event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02X\n", result);
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
    }
  }
  else
  {
    APP_DBG_MSG("--Connect_Request() Device Server Not Found\n");
    bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
  }
  
  APP_DBG_MSG("--Connect_Request() end \n");
  return;
}


/**
* @brief  Initiates the auto connection establishment procedure if bonded devices are found.
* 
* This function checks immediately if there are any bonded devices (in this scenario, peripheral bonded devices could be found).
* If the check is true, it means that a connection with a peripheral was previously established, and the auto connection establishment
* procedure can be started correctly.
* Handles the action for CFG_TASK_AUTO_CONNECTION_REQUEST event.
* 
* @retval None
*/
static void Start_Auto_Connection(void)
{  
  uint32_t status, paramA = SCAN_INT_MS(500), paramB = SCAN_WIN_MS(500);

  if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
  {
    status = aci_gap_configure_filter_accept_and_resolving_list(0x01);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : (FILTER) aci_gap_configure_filter_accept_and_resolving_list command, result: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("  Success: (FILTER) aci_gap_configure_filter_accept_and_resolving_list command\n");
    }
  }
  
  status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_scan_configuration - Success\n");
  }
  
  status = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                CONN_INT_MS(50u), 
                                                CONN_INT_MS(100u),
                                                0u,
                                                CONN_SUP_TIMEOUT_MS(5000u),
                                                CONN_CE_LENGTH_MS(10u), 
                                                CONN_CE_LENGTH_MS(10u));
  
