STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_CentralPeripheral/STM32_BLE/App/app_ble.c
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Success , result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Failed , result: 0x%02X\n", status);
  }  
  
  /* Start the auto connection establishment procedure */
  status = aci_gap_start_procedure(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC, LE_1M_PHY_BIT, 0, 0);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n", status);
  }
  else
  {
    bleAppContext.Device_Connection_Status_Central = APP_BLE_LP_CONNECTING_AUTO_CONNECTION;
    APP_DBG_MSG("==>> (FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
  }
  
  return;
}


/**
* @brief  Prints the list of bonded devices.
* 
* This function retrieves and prints the list of bonded devices. It iterates through all bonded devices
* and prints their address type and address. If no bonded devices are found, it prints a message indicating
* that there are no bonded devices.
* 
* @retval None
*/
void Print_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  APP_DBG_MSG("Bonded devices:\n");
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices)
    {
      APP_DBG_MSG("Type %d, @:%02X:%02X:%02X:%02X:%02X:%02X\n", bonded_device.Address_Type, bonded_device.Address[5], bonded_device.Address[4], bonded_device.Address[3], bonded_device.Address[2], bonded_device.Address[1], bonded_device.Address[0]);
    }
    else {
      break;
    }    
    num_bonded_devices += num_returned_devices;    
  }
  
  if(num_bonded_devices == 0){
    
    APP_DBG_MSG("No bonded devices.\n");
  }
}

/**
* @brief  Retrieves the number of bonded devices.
* 
* This function iterates through all bonded devices and counts the total number of bonded devices.
* 
* @retval uint8_t  The total number of bonded devices.
*/
uint8_t Get_Num_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices == 0){
      break;
    }
    num_bonded_devices += num_returned_devices;    
  }
  
  return num_bonded_devices;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */



#if (CFG_BUTTON_SUPPORTED == 1)

/**
* @brief  Handles the action for TASK_BUTTON_1 press event.
* 
* This function is called when Button 1 (B1) is pressed. It attempts to start advertising. 
* The function performs the following steps:
* - Checks if there are available slots to accept new central connections.
* - If the device is currently advertising in auto connection establishment mode, it stops this advertising.
* - If the device is idle, it starts advertising in general mode without a filter list to accept new central devices.
* - If advertising is already running, it prints a message indicating that advertising is already active.
* - A timer is added to stop advertising after a specified timeout period.
* 
* @retval None
*/
void APPE_Button1Action(void)
{
  /* Check if there are available slots to start advertising. If the maximum number of central connections is reached, print a message and exit. */
  if(APP_Context_canStartAdvertising() == -1)
  {
    APP_DBG_MSG("  Maximum number of Central connections reached. Advertising cannot be started.\n");
    return;
  }
  
  /* If the device is currently advertising in auto connection establishment mode, stop this advertising to allow starting advertising in general mode. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER)
  {
    Adv_Cancel();
  }
  
  /* If advertising is already running, print a message indicating that advertising is already active. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_LP)
  {
    APP_DBG_MSG("  Advertising is already running...\n");
    return;
  }
  
  /* If the device is idle, on connected as a server with at least one radio task free, start advertising in general mode to accept new central connections. Start a timer to stop advertising after a specified timeout period. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_IDLE || bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_CONNECTED_SERVER)
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
    HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id, ADV_TIMEOUT_MS);
    return;
  }
  
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_2 press event.
* 
* This function is called when Button 2 (B2) is pressed. It performs the following steps:
* - Checks if there are any active central connections by counting the total peripheral entities stored in the application context.
* - If the count is greater than zero, it sends notifications to all connected devices.
* - If no active connections are found, it clears the security database.
* 
* @retval None
*/
void APPE_Button2Action(void)
{
  /**
  * To understand if there are central devices connected, count the total peripheral entities stored in the application context.
  * Remember that in this case of notification, the application is working as a peripheral, so correctly check if there are peripheral entities stored in the app context of the peripheral.
  * If the count is greater than zero, notifications can be sent to all connected devices.
  */
  if(APP_Context_getActiveConnectionCountPeripheral() > 0)
  {
    APP_DBG_MSG("  Start Notification\n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_NOTIF_ID, CFG_SEQ_PRIO_0);
  }
  else /** Otherwise, clear the security database */
  {
    tBleStatus ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_3 press event.
* 
* This function is called when Button 3 (B3) is pressed. If the device is connected as a server,
* it terminates all current BLE connections for peripheral entities.
* 
* @retval None
*/
void APPE_Button3Action(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_TERMINATE_ALL_PERIPHERAL_CONNECTIONS, CFG_SEQ_PRIO_0);
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_1_LONG_PRESS press event.
* 
* This function is called when B1 is long pressed. It starts a GAP central scan procedure
* if the device is not connected as a client. If the device is connected as a client,
* it sets a task to write a characteristic.
* 
* @retval None
*/
void APPE_Button1LongPressAction(void)
{
  /* Check if there are available slots to start scanning. If the maximum number of connections (as Central) is reached, print a message and exit. */
  if(APP_Context_canStartScanning() == -1)
  {
    APP_DBG_MSG("  Maximum number of connections (with the role of Central) reached. Scanning cannot be started.\n");
    return;
  }
  if(bleAppContext.Device_Connection_Status_Central == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
  {
    APP_DBG_MSG("APP_BLE_LP_CONNECTING_AUTO_CONNECTION is running\n");
    
    uint8_t status = aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n",status);
    }
    else
    {
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
      APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
    }
  }
  if (bleAppContext.Device_Connection_Status_Central == APP_BLE_IDLE)
  {
    /* Call the function to start the scan procedure */
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  return;
}

void APPE_Button2LongPressAction(void)
{
  if(APP_Context_getActiveConnectionCountCentral() > 0)
  {
    UTIL_SEQ_SetTask( 1U << CFG_TASK_WRITE_ALL_CHAR_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    tBleStatus ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_3_LONG_PRESS press event.
* 
* This function is called when Button 3 (B3) is long pressed. It terminates all current BLE connections
* for all entity connected as a central.
* 
* @retval None
*/
void APPE_Button3LongPressAction(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_TERMINATE_ALL_CENTRAL_CONNECTIONS, CFG_SEQ_PRIO_0);
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
